Revit 2027 API
BuiltInFailures.SketchFailures.SiteCannotDrawSurfaceBoundary Property
 Cannot make surface with specified boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SiteCannotDrawSurfaceBoundary { get; }
Public Shared ReadOnly Property SiteCannotDrawSurfaceBoundary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SiteCannotDrawSurfaceBoundary {
	FailureDefinitionId^ get ();
}
static member SiteCannotDrawSurfaceBoundary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace